#include "MainForm.h"

/*
2-16. Створити однозв’язний список мешканців одного мікрорайону, який
містить персональні дані про кожного та адресу. Персональні дані
включають наступну інформацію: прізвище, ім’я, по батькові, рік
народження, площа житла. Адреса: вулиця, номер будинку, номер
квартири.

1) Реалізувати функції перегляду записаних даних, додавання нового
елемента на задану позицію (INSERT), видалення елемента з заданої
позиції (DELETE). Початковий вміст списку заповнити з клавіатури.

2) Побудувати нове двійкове дерево одного окремого будинку
(уводиться з клавіатури), вивести його мешканців у порядку
зростання віку. Оформити як окрему функцію.

*/

using namespace System;
using namespace System::Windows::Forms;

[STAThread]
void Main(array<String^>^ args) {
	Application::EnableVisualStyles;
	Application::SetCompatibleTextRenderingDefault(false);

	Project1::MainForm form;
	Application::Run(%form);
}